'''
有一个列表，[“北京”,”上海”,”广东”]
1)将中国所有省会城市添加到上述列表中
2)广东成为第二大发达城市，将广东排在上海前面
3)[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。
'''
city=["北京","上海","广东"]
temp=city[2]
city[2]=city[1]
city[1]=temp
print(city)
gdp=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
_average=0
_sum=0
for i in range(len(gdp)):
    _sum=_sum+gdp[i]
    print(_sum)
_average=_sum // len(gdp)
print("GDP之和为",_sum,"平均GDP为",_average)
